{
  "name": "John",
  "short": "A Narrative driven, point-and-click game set in Scotland during the 70's.",
  "long": "<h2>Description</h2>\n<p>A narrative-driven, point-and-click set in <em>Scotland during the 70's</em>.</p>\n<p>You are playing as <strong>John Mackilligan</strong>. A grieving, manic, enraged, recently laid-off carpet salesman, recounting your crimes to a <em>jury of your peers</em>.</p>\n<p>Your wee brother Rab has just died, and you have no way to pay for his funeral.</p>\n<p><em>If the negative symbol were removed from your debt, you'd be swimming in it.</em></p>\n<p>To get his revenge against his ex-boss, Mark <em>(and hopefully some cash)</em>, John plans to rob and terrorise the home.</p>\n<p>One small problem.</p>\n<p><em>He's got the wrong house...</em></p>\n<p>&nbsp;</p>\n<h2>Deep-Dive</h2>\n<p>I was one of the programmers on John, primarily responsible for the grid-based movement system, system linking, and the creation of designer-friendly tools for level construction, alongside various other supporting tasks.</p>\n<p>The movement system is built on Unity&rsquo;s Tilemap framework. Designers define walkable space directly by painting tiles onto a dedicated navigation Tilemap, which allows valid movement areas to be authored visually and iterated on quickly. Any tile present on this Tilemap is considered traversable by default.</p>\n<p>Obstacles are handled dynamically. Environmental objects tagged as obstacles are scanned at runtime, and their world-space bounds are converted into occupied grid cells. These cells are then marked as invalid for navigation and excluded from pathfinding. This approach allows obstacles to be enabled, disabled, or moved without requiring manual repainting of navigation tiles.</p>\n<p>Although the system supports collider-driven blocking, in practice, designers often prefer to manually remove navigation tiles in obstructed areas for clarity and control.&nbsp;</p>\n<p>Pathfinding is handled via an A* implementation operating directly on the Tilemap, ensuring predictable, tile-accurate movement for both mouse and controller input.</p>",
  "tags": [
    "Team",
    "School",
    "Unity",
    "2D",
    "Game",
    "C#",
    "PC"
  ],
  "outLinks": [
    {
      "name": "Itch",
      "url": "https://gluetrap-games.itch.io/john"
    }
  ],
  "cover": "images/cover.png",
  "additionalAssets": [
    "images/a1.png",
    "images/a2.png",
    "images/a3.png",
    "images/a4.png",
    "images/a5.png"
  ],
  "downloadFiles": [
    "files/John.zip"
  ],
  "page": "index.html"
}